mikeakohn/naken_asm/include/dspic/p33fj06gs101a.inc
 U1TXIF equ   0x000C
 ADIF equ     0x000D
 SI2C1IF equ  0x0000
 MI2C1IF equ  0x0001
 CNIF equ     0x0003
 INT1IF equ   0x0004
 INT2IF equ   0x000D
 PSEMIF equ   0x0009
 U1EIF equ    0x0001
 JTAGIF equ   0x0000
 PWM1IF equ   0x000E
 PWM4IF equ   0x0001
 ADCP0IF equ  0x000E
 ADCP1IF equ  0x000F
 ADCP3IF equ  0x0001
 INT0IE equ   0x0000
 OC1IE equ    0x0002
 T1IE equ     0x0003
 T2IE equ     0x0007
 SPI1EIE equ  0x0009
 SPI1IE equ   0x000A
 U1RXIE equ   0x000B
 U1TXIE equ   0x000C
 ADIE equ     0x000D
 SI2C1IE equ  0x0000
 MI2C1IE equ  0x0001
 CNIE equ     0x0003
 INT1IE equ   0x0004
 INT2IE equ   0x000D
 PSEMIE equ   0x0009
 U1EIE equ    0x0001
 JTAGIE equ   0x0000
 PWM1IE equ   0x000E
 PWM4IE equ   0x0001
 ADCP0IE equ  0x000E
 ADCP1IE equ  0x000F
 ADCP3IE equ  0x0001
 INT0IP0 equ  0x0000
 INT0IP1 equ  0x0001
 INT0IP2 equ  0x0002
 OC1IP0 equ   0x0008
 OC1IP1 equ   0x0009
 OC1IP2 equ   0x000A
 T1IP0 equ    0x000C
 T1IP1 equ    0x000D
 T1IP2 equ    0x000E
 T2IP0 equ    0x000C
 T2IP1 equ    0x000D
 T2IP2 equ    0x000E
 SPI1EIP0 equ  0x0004
 SPI1EIP1 equ  0x0005
 SPI1EIP2 equ  0x0006
 SPI1IP0 equ  0x0008
 SPI1IP1 equ  0x0009
 SPI1IP2 equ  0x000A
 U1RXIP0 equ  0x000C
 U1RXIP1 equ  0x000D
 U1RXIP2 equ  0x000E
 U1TXIP0 equ  0x0000
 U1TXIP1 equ  0x0001
 U1TXIP2 equ  0x0002
 ADIP0 equ    0x0004
 ADIP1 equ    0x0005
 ADIP2 equ    0x0006
 SI2C1IP0 equ  0x0000
 SI2C1IP1 equ  0x0001
 SI2C1IP2 equ  0x0002
 MI2C1IP0 equ  0x0004
 MI2C1IP1 equ  0x0005
 MI2C1IP2 equ  0x0006
 CNIP0 equ    0x000C
 CNIP1 equ    0x000D
 CNIP2 equ    0x000E
 INT1IP0 equ  0x0000
 INT1IP1 equ  0x0001
 INT1IP2 equ  0x0002
 INT2IP0 equ  0x0004
 INT2IP1 equ  0x0005
 INT2IP2 equ  0x0006
 PSEMIP0 equ  0x0004
 PSEMIP1 equ  0x0005
 PSEMIP2 equ  0x0006
 U1EIP0 equ   0x0004
 U1EIP1 equ   0x0005
 U1EIP2 equ   0x0006
 JTAGIP0 equ  0x0000
 JTAGIP1 equ  0x0001
 JTAGIP2 equ  0x0002
 PWM1IP0 equ  0x0008
 PWM1IP1 equ  0x0009
 PWM1IP2 equ  0x000A
 PWM4IP0 equ  0x0004
 PWM4IP1 equ  0x0005
 PWM4IP2 equ  0x0006
 ADCP0IP0 equ  0x0008
 ADCP0IP1 equ  0x0009
 ADCP0IP2 equ  0x000A
 ADCP1IP0 equ  0x000C
 ADCP1IP1 equ  0x000D
 ADCP1IP2 equ  0x000E
 ADCP3IP0 equ  0x0004
 ADCP3IP1 equ  0x0005
 ADCP3IP2 equ  0x0006
 VECNUM0 equ  0x0000
 VECNUM1 equ  0x0001
 VECNUM2 equ  0x0002
 VECNUM3 equ  0x0003
 VECNUM4 equ  0x0004
 VECNUM5 equ  0x0005
 VECNUM6 equ  0x0006
 ILR0 equ     0x0008
 ILR1 equ     0x0009
 ILR2 equ     0x000A
 ILR3 equ     0x000B
 TCS equ      0x0001
 TSYNC equ    0x0002
 TGATE equ    0x0006
 TSIDL equ    0x000D
 TON equ      0x000F
 TCKPS0 equ   0x0004
 TCKPS1 equ   0x0005
 OCFLT equ    0x0004
 OCSIDL equ   0x000D
 OCM0 equ     0x0000
 OCM1 equ     0x0001
 OCM2 equ     0x0002
 SEN equ      0x0000
 RSEN equ     0x0001
 PEN equ      0x0002
 RCEN equ     0x0003
 ACKEN equ    0x0004
 ACKDT equ    0x0005
 STREN equ    0x0006
 GCEN equ     0x0007
 SMEN equ     0x0008
 DISSLW equ   0x0009
 A10M equ     0x000A
 IPMIEN equ   0x000B
 SCLREL equ   0x000C
 I2CSIDL equ  0x000D
 I2CEN equ    0x000F
 TBF equ      0x0000
 RBF equ      0x0001
 R_W equ      0x0002
 S equ        0x0003
 P equ        0x0004
 D_A equ      0x0005
 I2COV equ    0x0006
 IWCOL equ    0x0007
 ADD10 equ    0x0008
 GCSTAT equ   0x0009
 BCL equ      0x000A
 TRSTAT equ   0x000E
 ACKSTAT equ  0x000F
 STSEL equ    0x0000
 BRGH equ     0x0003
 URXINV equ   0x0004
 ABAUD equ    0x0005
 LPBACK equ   0x0006
 WAKE equ     0x0007
 RTSMD equ    0x000B
 IREN equ     0x000C
 USIDL equ    0x000D
 UARTEN equ   0x000F
 PDSEL0 equ   0x0001
 PDSEL1 equ   0x0002
 UEN0 equ     0x0008
 UEN1 equ     0x0009
 URXDA equ    0x0000
 OERR equ     0x0001
 FERR equ     0x0002
 PERR equ     0x0003
 RIDLE equ    0x0004
 ADDEN equ    0x0005
 TRMT equ     0x0008
 UTXBF equ    0x0009
 UTXEN equ    0x000A
 UTXBRK equ   0x000B
 UTXISEL0 equ  0x000D
 UTXINV equ   0x000E
 UTXISEL1 equ  0x000F
 URXISEL0 equ  0x0006
 URXISEL1 equ  0x0007
 UTXREG0 equ  0x0000
 UTXREG1 equ  0x0001
 UTXREG2 equ  0x0002
 UTXREG3 equ  0x0003
 UTXREG4 equ  0x0004
 UTXREG5 equ  0x0005
 UTXREG6 equ  0x0006
 UTXREG7 equ  0x0007
 UTXREG8 equ  0x0008
 URXREG0 equ  0x0000
 URXREG1 equ  0x0001
 URXREG2 equ  0x0002
 URXREG3 equ  0x0003
 URXREG4 equ  0x0004
 URXREG5 equ  0x0005
 URXREG6 equ  0x0006
 URXREG7 equ  0x0007
 URXREG8 equ  0x0008
 SPIRBF equ   0x0000
 SPITBF equ   0x0001
 SPIROV equ   0x0006
 SPISIDL equ  0x000D
 SPIEN equ    0x000F
 MSTEN equ    0x0005
 CKP equ      0x0006
 SSEN equ     0x0007
 CKE equ      0x0008
 SMP equ      0x0009
 MODE16 equ   0x000A
 DISSDO equ   0x000B
 DISSCK equ   0x000C
 PPRE0 equ    0x0000
 PPRE1 equ    0x0001
 SPRE0 equ    0x0002
 SPRE1 equ    0x0003
 SPRE2 equ    0x0004
 FRMDLY equ   0x0001
 FRMPOL equ   0x000D
 SPIFSD equ   0x000E
 FRMEN equ    0x000F
 TRISA0 equ   0x0000
 TRISA1 equ   0x0001
 TRISA2 equ   0x0002
 TRISA3 equ   0x0003
 TRISA4 equ   0x0004
 RA0 equ      0x0000
 RA1 equ      0x0001
 RA2 equ      0x0002
 RA3 equ      0x0003
 RA4 equ      0x0004
 LATA0 equ    0x0000
 LATA1 equ    0x0001
 LATA2 equ    0x0002
 LATA3 equ    0x0003
 LATA4 equ    0x0004
 ODCA3 equ    0x0003
 ODCA4 equ    0x0004
 TRISB0 equ   0x0000
 TRISB1 equ   0x0001
 TRISB2 equ   0x0002
 TRISB3 equ   0x0003
 TRISB4 equ   0x0004
 TRISB5 equ   0x0005
 TRISB6 equ   0x0006
 TRISB7 equ   0x0007
 RB0 equ      0x0000
 RB1 equ      0x0001
 RB2 equ      0x0002
 RB3 equ      0x0003
 RB4 equ      0x0004
 RB5 equ      0x0005
 RB6 equ      0x0006
 RB7 equ      0x0007
 LATB0 equ    0x0000
 LATB1 equ    0x0001
 LATB2 equ    0x0002
 LATB3 equ    0x0003
 LATB4 equ    0x0004
 LATB5 equ    0x0005
 LATB6 equ    0x0006
 LATB7 equ    0x0007
 ODCB6 equ    0x0006
 ODCB7 equ    0x0007
 ASYNCSAMP equ  0x0004
 SEQSAMP equ  0x0005
 ORDER equ    0x0006
 EIE equ      0x0007
 FORM equ     0x0008
 GSWTRG equ   0x000A
 SLOWCLK equ  0x000C
 ADSIDL equ   0x000D
 ADON equ     0x000F
 ADCS0 equ    0x0000
 ADCS1 equ    0x0001
 ADCS2 equ    0x0002
 PCFG0 equ    0x0000
 PCFG1 equ    0x0001
 PCFG2 equ    0x0002
 PCFG3 equ    0x0003
 PCFG6 equ    0x0006
 PCFG7 equ    0x0007
 P0RDY equ    0x0000
 P1RDY equ    0x0001
 P3RDY equ    0x0003
 P6RDY equ    0x0006
 SWTRG0 equ   0x0005
 PEND0 equ    0x0006
 IRQEN0 equ   0x0007
 SWTRG1 equ   0x000D
 PEND1 equ    0x000E
 IRQEN1 equ   0x000F
 TRGSRC00 equ  0x0000
 TRGSRC01 equ  0x0001
 TRGSRC02 equ  0x0002
 TRGSRC03 equ  0x0003
 TRGSRC04 equ  0x0004
 TRGSRC10 equ  0x0008
 TRGSRC11 equ  0x0009
 TRGSRC12 equ  0x000A
 TRGSRC13 equ  0x000B
 TRGSRC14 equ  0x000C
 SWTRG3 equ   0x000D
 PEND3 equ    0x000E
 IRQEN3 equ   0x000F
 TRGSRC30 equ  0x0008
 TRGSRC31 equ  0x0009
 TRGSRC32 equ  0x000A
 TRGSRC33 equ  0x000B
 TRGSRC34 equ  0x000C
 SWTRG6 equ   0x0005
 PEND6 equ    0x0006
 IRQEN6 equ   0x0007
 TRGSRC60 equ  0x0000
 TRGSRC61 equ  0x0001
 TRGSRC62 equ  0x0002
 TRGSRC63 equ  0x0003
 TRGSRC64 equ  0x0004
 SYNCEN equ   0x0007
 SYNCOEN equ  0x0008
 SYNCPOL equ  0x0009
 EIPU equ     0x000A
 SEIEN equ    0x000B
 SESTAT equ   0x000C
 PTSIDL equ   0x000D
 PTEN equ     0x000F
 SEVTPS0 equ  0x0000
 SEVTPS1 equ  0x0001
 SEVTPS2 equ  0x0002
 SEVTPS3 equ  0x0003
 SYNCSRC0 equ  0x0004
 SYNCSRC1 equ  0x0005
 PCLKDIV0 equ  0x0000
 PCLKDIV1 equ  0x0001
 PCLKDIV2 equ  0x0002
 CHPCLKEN equ  0x000F
 CHOPCLK0 equ  0x0003
 CHOPCLK1 equ  0x0004
 CHOPCLK2 equ  0x0005
 CHOPCLK3 equ  0x0006
 CHOPCLK4 equ  0x0007
 CHOPCLK5 equ  0x0008
 CHOPCLK6 equ  0x0009
 IUE equ      0x0000
 XPRES equ    0x0001
 CAM equ      0x0002
 MDCS equ     0x0008
 ITB equ      0x0009
 TRGIEN equ   0x000A
 CLIEN equ    0x000B
 FLTIEN equ   0x000C
 TRGSTAT equ  0x000D
 CLSTAT equ   0x000E
 FLTSTAT equ  0x000F
 DTC0 equ     0x0006
 DTC1 equ     0x0007
 OSYNC equ    0x0000
 SWAP equ     0x0001
 OVRENL equ   0x0008
 OVRENH equ   0x0009
 POLL equ     0x000C
 POLH equ     0x000D
 PENL equ     0x000E
 PENH equ     0x000F
 CLDAT0 equ   0x0002
 CLDAT1 equ   0x0003
 FLTDAT0 equ  0x0004
 FLTDAT1 equ  0x0005
 OVRDAT0 equ  0x0006
 OVRDAT1 equ  0x0007
 PMOD0 equ    0x000A
 PMOD1 equ    0x000B
 FLTPOL equ   0x0002
 CLMOD equ    0x0008
 CLPOL equ    0x0009
 IFLTMOD equ  0x000F
 FLTMOD0 equ  0x0000
 FLTMOD1 equ  0x0001
 FLTSRC0 equ  0x0003
 FLTSRC1 equ  0x0004
 FLTSRC2 equ  0x0005
 FLTSRC3 equ  0x0006
 FLTSRC4 equ  0x0007
 CLSRC0 equ   0x000A
 CLSRC1 equ   0x000B
 CLSRC2 equ   0x000C
 CLSRC3 equ   0x000D
 CLSRC4 equ   0x000E
 TRGCMP0 equ  0x0003
 TRGCMP1 equ  0x0004
 TRGCMP2 equ  0x0005
 TRGCMP3 equ  0x0006
 TRGCMP4 equ  0x0007
 TRGCMP5 equ  0x0008
 TRGCMP6 equ  0x0009
 TRGCMP7 equ  0x000A
 TRGCMP8 equ  0x000B
 TRGCMP9 equ  0x000C
 TRGCMP10 equ  0x000D
 TRGCMP11 equ  0x000E
 TRGCMP12 equ  0x000F
 DTM equ      0x0007
 TRGSTRT0 equ  0x0000
 TRGSTRT1 equ  0x0001
 TRGSTRT2 equ  0x0002
 TRGSTRT3 equ  0x0003
 TRGSTRT4 equ  0x0004
 TRGSTRT5 equ  0x0005
 TRGDIV0 equ  0x000C
 TRGDIV1 equ  0x000D
 TRGDIV2 equ  0x000E
 TRGDIV3 equ  0x000F
 STRGCMP0 equ  0x0003
 STRGCMP1 equ  0x0004
 STRGCMP2 equ  0x0005
 STRGCMP3 equ  0x0006
 STRGCMP4 equ  0x0007
 STRGCMP5 equ  0x0008
 STRGCMP6 equ  0x0009
 STRGCMP7 equ  0x000A
 STRGCMP8 equ  0x000B
 STRGCMP9 equ  0x000C
 STRGCMP10 equ  0x000D
 STRGCMP11 equ  0x000E
 STRGCMP12 equ  0x000F
 PWMCAP10 equ  0x0003
 PWMCAP11 equ  0x0004
 PWMCAP12 equ  0x0005
 PWMCAP13 equ  0x0006
 PWMCAP14 equ  0x0007
 PWMCAP15 equ  0x0008
 PWMCAP16 equ  0x0009
 PWMCAP17 equ  0x000A
 PWMCAP18 equ  0x000B
 PWMCAP19 equ  0x000C
 PWMCAP110 equ  0x000D
 PWMCAP111 equ  0x000E
 PWMCAP112 equ  0x000F
 CLLEBEN equ  0x000A
 FLTLEBEN equ  0x000B
 PLF equ      0x000C
 PLR equ      0x000D
 PHF equ      0x000E
 PHR equ      0x000F
 LEB0 equ     0x0003
 LEB1 equ     0x0004
 LEB2 equ     0x0005
 LEB3 equ     0x0006
 LEB4 equ     0x0007
 LEB5 equ     0x0008
 LEB6 equ     0x0009
 CHOPLEN equ  0x0000
 CHOPHEN equ  0x0001
 HRDDIS equ   0x000E
 HRPDIS equ   0x000F
 INT1R0 equ   0x0008
 INT1R1 equ   0x0009
 INT1R2 equ   0x000A
 INT1R3 equ   0x000B
 INT1R4 equ   0x000C
 INT1R5 equ   0x000D
 INT2R0 equ   0x0000
 INT2R1 equ   0x0001
 INT2R2 equ   0x0002
 INT2R3 equ   0x0003
 INT2R4 equ   0x0004
 INT2R5 equ   0x0005
 T1CKR0 equ   0x0008
 T1CKR1 equ   0x0009
 T1CKR2 equ   0x000A
 T1CKR3 equ   0x000B
 T1CKR4 equ   0x000C
 T1CKR5 equ   0x000D
 T2CKR0 equ   0x0000
 T2CKR1 equ   0x0001
 T2CKR2 equ   0x0002
 T2CKR3 equ   0x0003
 T2CKR4 equ   0x0004
 T2CKR5 equ   0x0005
 OCFAR0 equ   0x0000
 OCFAR1 equ   0x0001
 OCFAR2 equ   0x0002
 OCFAR3 equ   0x0003
 OCFAR4 equ   0x0004
 OCFAR5 equ   0x0005
 U1RXR0 equ   0x0000
 U1RXR1 equ   0x0001
 U1RXR2 equ   0x0002
 U1RXR3 equ   0x0003
 U1RXR4 equ   0x0004
 U1RXR5 equ   0x0005
 U1CTSR0 equ  0x0008
 U1CTSR1 equ  0x0009
 U1CTSR2 equ  0x000A
 U1CTSR3 equ  0x000B
 U1CTSR4 equ  0x000C
 U1CTSR5 equ  0x000D
 SDI1R0 equ   0x0000
 SDI1R1 equ   0x0001
 SDI1R2 equ   0x0002
 SDI1R3 equ   0x0003
 SDI1R4 equ   0x0004
 SDI1R5 equ   0x0005
 SCK1R0 equ   0x0008
 SCK1R1 equ   0x0009
 SCK1R2 equ   0x000A
 SCK1R3 equ   0x000B
 SCK1R4 equ   0x000C
 SCK1R5 equ   0x000D
 SS1R0 equ    0x0000
 SS1R1 equ    0x0001
 SS1R2 equ    0x0002
 SS1R3 equ    0x0003
 SS1R4 equ    0x0004
 SS1R5 equ    0x0005
 FLT1R0 equ   0x0008
 FLT1R1 equ   0x0009
 FLT1R2 equ   0x000A
 FLT1R3 equ   0x000B
 FLT1R4 equ   0x000C
 FLT1R5 equ   0x000D
 FLT2R0 equ   0x0000
 FLT2R1 equ   0x0001
 FLT2R2 equ   0x0002
 FLT2R3 equ   0x0003
 FLT2R4 equ   0x0004
 FLT2R5 equ   0x0005
 FLT3R0 equ   0x0008
 FLT3R1 equ   0x0009
 FLT3R2 equ   0x000A
 FLT3R3 equ   0x000B
 FLT3R4 equ   0x000C
 FLT3R5 equ   0x000D
 FLT4R0 equ   0x0000
 FLT4R1 equ   0x0001
 FLT4R2 equ   0x0002
 FLT4R3 equ   0x0003
 FLT4R4 equ   0x0004
 FLT4R5 equ   0x0005
 FLT5R0 equ   0x0008
 FLT5R1 equ   0x0009
 FLT5R2 equ   0x000A
 FLT5R3 equ   0x000B
 FLT5R4 equ   0x000C
 FLT5R5 equ   0x000D
 FLT6R0 equ   0x0000
 FLT6R1 equ   0x0001
 FLT6R2 equ   0x0002
 FLT6R3 equ   0x0003
 FLT6R4 equ   0x0004
 FLT6R5 equ   0x0005
 FLT7R0 equ   0x0008
 FLT7R1 equ   0x0009
 FLT7R2 equ   0x000A
 FLT7R3 equ   0x000B
 FLT7R4 equ   0x000C
 FLT7R5 equ   0x000D
 FLT8R0 equ   0x0000
 FLT8R1 equ   0x0001
 FLT8R2 equ   0x0002
 FLT8R3 equ   0x0003
 FLT8R4 equ   0x0004
 FLT8R5 equ   0x0005
 SYNCI1R0 equ  0x0008
 SYNCI1R1 equ  0x0009
 SYNCI1R2 equ  0x000A
 SYNCI1R3 equ  0x000B
 SYNCI1R4 equ  0x000C
 SYNCI1R5 equ  0x000D
 SYNCI2R0 equ  0x0000
 SYNCI2R1 equ  0x0001
 SYNCI2R2 equ  0x0002
 SYNCI2R3 equ  0x0003
 SYNCI2R4 equ  0x0004
 SYNCI2R5 equ  0x0005
 RP0R0 equ    0x0000
 RP0R1 equ    0x0001
 RP0R2 equ    0x0002
 RP0R3 equ    0x0003
 RP0R4 equ    0x0004
 RP0R5 equ    0x0005
 RP1R0 equ    0x0008
 RP1R1 equ    0x0009
 RP1R2 equ    0x000A
 RP1R3 equ    0x000B
 RP1R4 equ    0x000C
 RP1R5 equ    0x000D
 RP2R0 equ    0x0000
 RP2R1 equ    0x0001
 RP2R2 equ    0x0002
 RP2R3 equ    0x0003
 RP2R4 equ    0x0004
 RP2R5 equ    0x0005
 RP3R0 equ    0x0008
 RP3R1 equ    0x0009
 RP3R2 equ    0x000A
 RP3R3 equ    0x000B
 RP3R4 equ    0x000C
 RP3R5 equ    0x000D
 RP4R0 equ    0x0000
 RP4R1 equ    0x0001
 RP4R2 equ    0x0002
 RP4R3 equ    0x0003
 RP4R4 equ    0x0004
 RP4R5 equ    0x0005
 RP5R0 equ    0x0008
 RP5R1 equ    0x0009
 RP5R2 equ    0x000A
 RP5R3 equ    0x000B
 RP5R4 equ    0x000C
 RP5R5 equ    0x000D
 RP6R0 equ    0x0000
 RP6R1 equ    0x0001
 RP6R2 equ    0x0002
 RP6R3 equ    0x0003
 RP6R4 equ    0x0004
 RP6R5 equ    0x0005
 RP7R0 equ    0x0008
 RP7R1 equ    0x0009
 RP7R2 equ    0x000A
 RP7R3 equ    0x000B
 RP7R4 equ    0x000C
 RP7R5 equ    0x000D
 RP32R0 equ   0x0000
 RP32R1 equ   0x0001
 RP32R2 equ   0x0002
 RP32R3 equ   0x0003
 RP32R4 equ   0x0004
 RP32R5 equ   0x0005
 RP33R0 equ   0x0008
 RP33R1 equ   0x0009
 RP33R2 equ   0x000A
 RP33R3 equ   0x000B
 RP33R4 equ   0x000C
 RP33R5 equ   0x000D
 RP34R0 equ   0x0000
 RP34R1 equ   0x0001
 RP34R2 equ   0x0002
 RP34R3 equ   0x0003
 RP34R4 equ   0x0004
 RP34R5 equ   0x0005
 RP35R0 equ   0x0008
 RP35R1 equ   0x0009
 RP35R2 equ   0x000A
 RP35R3 equ   0x000B
 RP35R4 equ   0x000C
 RP35R5 equ   0x000D
 POR equ      0x0000
 BOR equ      0x0001
 IDLE equ     0x0002
 SLEEP equ    0x0003
 WDTO equ     0x0004
 SWDTEN equ   0x0005
 SWR equ      0x0006
 EXTR equ     0x0007
 VREGS equ    0x0008
 CM equ       0x0009
 IOPUWR equ   0x000E
 TRAPR equ    0x000F
 OSWEN equ    0x0000
 CF equ       0x0003
 LOCK equ     0x0005
 IOLOCK equ   0x0006
 CLKLOCK equ  0x0007
 NOSC0 equ    0x0008
 NOSC1 equ    0x0009
 NOSC2 equ    0x000A
 COSC0 equ    0x000C
 COSC1 equ    0x000D
 COSC2 equ    0x000E
 DOZEN equ    0x000B
 ROI equ      0x000F
 PLLPRE0 equ  0x0000
 PLLPRE1 equ  0x0001
 PLLPRE2 equ  0x0002
 PLLPRE3 equ  0x0003
 PLLPRE4 equ  0x0004
 PLLPOST0 equ  0x0006
 PLLPOST1 equ  0x0007
 FRCDIV0 equ  0x0008
 FRCDIV1 equ  0x0009
 FRCDIV2 equ  0x000A
 DOZE0 equ    0x000C
 DOZE1 equ    0x000D
 DOZE2 equ    0x000E
 PLLDIV0 equ  0x0000
 PLLDIV1 equ  0x0001
 PLLDIV2 equ  0x0002
 PLLDIV3 equ  0x0003
 PLLDIV4 equ  0x0004
 PLLDIV5 equ  0x0005
 PLLDIV6 equ  0x0006
 PLLDIV7 equ  0x0007
 PLLDIV8 equ  0x0008
 TUN0 equ     0x0000
 TUN1 equ     0x0001
 TUN2 equ     0x0002
 TUN3 equ     0x0003
 TUN4 equ     0x0004
 TUN5 equ     0x0005
 ROSEL equ    0x000C
 ROSIDL equ   0x000D
 ROON equ     0x000F
 RODIV0 equ   0x0008
 RODIV1 equ   0x0009
 RODIV2 equ   0x000A
 RODIV3 equ   0x000B
 ROSSLP equ   0x000D
 FRCSEL equ   0x0006
 ASRCSEL equ  0x0007
 SELACLK equ  0x000D
 APLLCK equ   0x000E
 ENAPLL equ   0x000F
 APSTSCLR0 equ  0x0008
 APSTSCLR1 equ  0x0009
 APSTSCLR2 equ  0x000A
 ERASE equ    0x0006
 WRERR equ    0x000D
 WREN equ     0x000E
 WR equ       0x000F
 NVMOP0 equ   0x0000
 NVMOP1 equ   0x0001
 NVMOP2 equ   0x0002
 NVMOP3 equ   0x0003
 ADCMD equ    0x0000
 SPI1MD equ   0x0003
 U1MD equ     0x0005
 I2C1MD equ   0x0007
 PWMMD equ    0x0009
 T1MD equ     0x000B
 T2MD equ     0x000C
 OC1MD equ    0x0000
 REFOMD equ   0x0003
 PWM1MD equ   0x0008
 PWM4MD equ   0x000B
 SLEEP_MODE equ  0x0
 IDLE_MODE equ  0x1
 ICS_NONE equ         0xFFFC ; Reserved
 ICS_PGD3 equ         0xFFFD ; Communicate on PGEC3 and PGED3
 ICS_PGD2 equ         0xFFFE ; Communicate on PGEC2 and PGED2
 ICS_PGD1 equ         0xFFFF ; Communicate on PGEC1 and PGED1
 JTAGEN_OFF equ       0xFFDF ; JTAG is disabled
 JTAGEN_ON equ        0xFFFF ; JTAG is enabled
 WDTPOST_PS1 equ      0xFFF0 ; 1:1
 WDTPOST_PS2 equ      0xFFF1 ; 1:2
 WDTPOST_PS4 equ      0xFFF2 ; 1:4
 WDTPOST_PS8 equ      0xFFF3 ; 1:8
 WDTPOST_PS16 equ     0xFFF4 ; 1:16
 WDTPOST_PS32 equ     0xFFF5 ; 1:32
 WDTPOST_PS64 equ     0xFFF6 ; 1:64
 WDTPOST_PS128 equ    0xFFF7 ; 1:128
 WDTPOST_PS256 equ    0xFFF8 ; 1:256
 WDTPOST_PS512 equ    0xFFF9 ; 1:512
 WDTPOST_PS1024 equ   0xFFFA ; 1:1
 WDTPOST_PS2048 equ   0xFFFB ; 1:2
 WDTPOST_PS4096 equ   0xFFFC ; 1:4
 WDTPOST_PS8192 equ   0xFFFD ; 1:8
 WDTPOST_PS16384 equ  0xFFFE ; 1:16
 WDTPOST_PS32768 equ  0xFFFF ; 1:32
 WDTPRE_PR32 equ      0xFFEF ; 1:32
 WDTPRE_PR128 equ     0xFFFF ; 1:128
 PLLKEN_OFF equ       0xFFDF ; Clock switch will not wait for the PLL lock signal.
 PLLKEN_ON equ        0xFFFF ; Clock switch to PLL source will wait until the PLL lock signal is valid.
 FWDTEN_OFF equ       0xFF7F ; Watchdog timer enabled/disabled by user software
 FWDTEN_ON equ        0xFFFF ; Watchdog timer always enabled
 POSCMD_EC equ        0xFFFC ; EC (External Clock) Mode
 POSCMD_XT equ        0xFFFD ; XT Crystal Oscillator Mode
 POSCMD_HS equ        0xFFFE ; HS Crystal Oscillator Mode
 POSCMD_NONE equ      0xFFFF ; Primary Oscillator disabled
 OSCIOFNC_ON equ      0xFFFB ; OSC2 is general purpose digital I/O pin
 OSCIOFNC_OFF equ     0xFFFF ; OSC2 is clock output
 IOL1WAY_OFF equ      0xFFDF ; Allow multiple reconfigurations
 IOL1WAY_ON equ       0xFFFF ; Allow only one reconfiguration
 FCKSM_CSECME equ     0xFF3F ; Both Clock switching and Fail-safe Clock Monitor are enabled
 FCKSM_CSECMD equ     0xFF7F ; Clock switching is enabled
 FCKSM_CSDCMD equ     0xFFBF ; Both Clock switching and Fail-safe Clock Monitor are disabled
 FNOSC_FRC equ        0xFFF8 ; Internal Fast RC (FRC)
 FNOSC_FRCPLL equ     0xFFF9 ; Fast RC Oscillator with divide-by-N with PLL module (FRCPLL)
 FNOSC_PRI equ        0xFFFA ; Primary Oscillator (XT
 FNOSC_PRIPLL equ     0xFFFB ; Primary Oscillator with PLL module (XT + PLL
 FNOSC_LPRC equ       0xFFFD ; Low-Power RC Oscillator (LPRC)
 FNOSC_FRCDIVN equ    0xFFFF ; Internal Fast RC (FRC) Oscillator with postscaler
 IESO_OFF equ         0xFF7F ; Start up with user-selected oscillator source
 IESO_ON equ          0xFFFF ; Start up device with FRC
 GWRP_ON equ          0xFFFE ; General Segment is write protected
 GWRP_OFF equ         0xFFFF ; General Segment may be written
 GCP_ON equ           0xFFFD ; General Segment Code protection Enabled
 GCP_OFF equ          0xFFFF ; General Segment Code protect is Disabled
